# config.py

import os
import logging
from dotenv import load_dotenv

# --- НАЛАШТУВАННЯ ТА ІНІЦІАЛІЗАЦІЯ ---

load_dotenv()
TOKEN = os.getenv("API_KEY")

if not TOKEN:
    raise ValueError("❌ API_KEY не знайдено у .env файлі!")

# --- ШЛЯХИ ---
USERS_FILE = "../users.json"
DATA_DIR = "../parser/data"

# --- КОНФІГУРАЦІЯ БОТА ---
CHECK_INTERVAL_SEC = 300  # Раз на 5 хвилин

# --- МАПА РЕГІОНІВ ТА ОБЛАСТЕЙ ---
REGIONS = {
    "west": {
        "title": "Західний 🇺🇦",
        "areas": {
            "lviv": "Львівська", "ivano-frankivsk": "Івано-Франківська", "ternopil": "Тернопільська",
            "volyn": "Волинська", "rivne": "Рівненська", "zakarpattia": "Закарпатська",
            "chernivtsi": "Чернівецька", "khmelnytskyi": "Хмельницька",
        }
    },
    "north": {
        "title": "Північний та Центр 🌻",
        "areas": {
            "kyivcity": "Київ (Місто)", "kyivobl": "Київська (Область)", "zhytomyr": "Житомирська",
            "vinnytsia": "Вінницька", "chernihiv": "Чернігівська", "sumy": "Сумська",
            "cherkasy": "Черкаська", "kirovohrad": "Кіровоградська", "poltava": "Полтавська",
        }
    },
    "south": {
        "title": "Південний 🌊",
        "areas": {
            "odesa": "Одеська", "mykolaiv": "Миколаївська", "kherson": "Херсонська",
            "zaporizhzhia": "Запорізька",
        }
    },
    "east": {
        "title": "Східний 🛡️",
        "areas": {
            "dnipro": "Дніпропетровська", "kharkiv": "Харківська", "donetsk": "Донецька",
            "luhansk": "Луганська",
        }
    }
}

# Плоский список усіх кодів областей
AVAILABLE_AREA_CODES = {
    code: title for region in REGIONS.values() for code, title in region['areas'].items()
}


# --- НАЛАШТУВАННЯ ЛОГУВАННЯ ---

logging.basicConfig(
    level=logging.INFO,
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s' # Додано форматування для кращої читабельності
)
logger = logging.getLogger(__name__)


# --- ГЛОБАЛЬНІ СТРУКТУРИ ДАНИХ (для воркера, оскільки вони змінюються під час виконання) ---
SENT_REMINDERS_LOG = {}
LAST_SCHEDULE_HASH = {}

